#+title: Ps 05
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-01-11>
#+lastmod: <2026-01-11 20:19>
#+options: num:t
#+startup: overview
#+latex: \newpage

*** Code
#+begin_src julia :results values :export both :tangle julia/p_1.jl
using Plots

f(x) = exp(2*x) + x

x = -10:0.1:1
y = f.(x)

plot(x, y,
     title="f(x) = e^(2x) + x",
     xlabel="x",
     ylabel="y",
     linewidth=2)

savefig("./figs/p_01.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_05/figs/p_01.png

*** Code
#+begin_src julia :results value :export both :tangle julia/p_2.jl
using Plots

# define the function and parameters
f(x) = log(x)
a = 1.0
b = exp(1) # e

# define the Solution (xi) you found mathematically
xi = b - 1  # ξ = e - 1

# calculate slopes and line equations
# slope of the Secant line (Average rate of change)
m_secant = (f(b) - f(a)) / (b - a)

# define the Secant Line function: y = f(a) + m * (x - a)
secant_line(x) = f(a) + m_secant * (x - a)

# define the Tangent Line function at xi: y = f(xi) + f'(xi) * (x - xi)
tangent_line(x) = f(xi) + m_secant * (x - xi)

# generate data for plotting
x_vals = range(a, b, length=100)
y_vals = f.(x_vals)

# plotting
# plot the main function
plot(x_vals, y_vals,
     label="f(x) = ln(x)",
     linewidth=3,
     legend=:bottomright,
     title="Mean Value Theorem Illustration",
     xlabel="x", ylabel="y")

# plot the Secant Line (connecting endpoints)
plot!(x_vals, secant_line.(x_vals),
      label="Secant Line",
      linestyle=:dash,
      linewidth=2)

# plot the Tangent Line (at xi)
plot!(x_vals, tangent_line.(x_vals),
      label="Tangent at ξ",
      linewidth=2)

# add a marker for the point xi
scatter!([xi], [f(xi)],
         label="Point (ξ, f(ξ))",
         markersize=5)

plot!([xi, xi], [0, f(xi)], label="", linestyle=:dot, color=:grey)

savefig("./figs/p_02.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_05/figs/p_02.png

*** Code
#+begin_src julia :results value :export both :tangle julia/p_3.jl
using Plots

f(x) = x^3 - 3x^2 + 2

# Plotting range covering the interesting features
x = -1.5:0.05:3.5
y = f.(x)

p = plot(x, y,
     title = "f(x) = x^3 - 3x^2 + 2",
     xlabel = "x",
     ylabel = "y",
     label = "f(x)",
     linewidth = 2,
     legend = :topright)

# Mark the guessed extrema for visualization
scatter!([0, 2], [f(0), f(2)], label="Extrema guesses", color=:red)

savefig("./figs/p_03.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_05/figs/p_03.png

*** Code
#+begin_src julia :results value :export both :tangle julia/p_4.jl
using Plots

f(x) = x^4 - 2x^2 + 1

# plotting range
x = -2.2:0.05:2.2
y = f.(x)

plot(x, y,
     title = "Global Extrema of f(x) = x^4 - 2x^2 + 1",
     xlabel = "x",
     ylabel = "y",
     label = "f(x)",
     linewidth = 2,
     legend = :top)

# highlight Global Maxima
scatter!([-2, 2], [f(-2), f(2)], label="Global Maxima", color=:red, markersize=5)

# highlight Global Minima
scatter!([-1, 1], [f(-1), f(1)], label="Global Minima", color=:blue, markersize=5)

plot!([-2,2], seriestype = :vline, label="Domain")

savefig("./figs/p_04.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_05/figs/p_04.png

